package org.gms.constants.id;

import java.util.List;

/**
 * 提取出来金银岛和神秘岛有怪物的地图
 *
 * @author dwang
 * @version 1.0
 * @since 2026/9/29 13:34
 */
public class MapExistMob {
    // 金银岛 - 野外有怪物的地图
    // 金银岛 - 野外有怪物的地图
    public static final List<Integer> VICTORIA_ISLAND_FIELD_MAPS = List.of(
            100000002,  // 金银岛 - 花蘑菇
            100000003,  // 金银岛 - 蘑菇公园Ⅰ
            100000004,  // 金银岛 - 蘑菇公园Ⅱ
            100000005,  // 金银岛 - 蘑菇公园Ⅲ
            100010000,  // 金银岛 - 射手村东部小山
            100020000,  // 金银岛 - 射手村东部草丛
            100030000,  // 金银岛 - 射手村东部树林
            100030001,  // 金银岛 - 青蘑菇树林
            100040000,  // 金银岛 - 魔法森林南部
            100040001,  // 金银岛 - 南部森林训练场Ⅰ
            100040002,  // 金银岛 - 南部森林训练场Ⅱ
            100040003,  // 金银岛 - 南部森林训练场Ⅲ
            100040004,  // 金银岛 - 南部森林训练场Ⅳ
            100040100,  // 金银岛 - 智慧森林
            100040101,  // 金银岛 - 猴子森林I
            100040102,  // 金银岛 - 猴林迷宫I
            100040103,  // 金银岛 - 猴子森林Ⅱ
            100040104,  // 金银岛 - 猴林迷宫Ⅱ
            100040105,  // 金银岛 - 巫婆森林Ⅰ
            100040106,  // 金银岛 - 巫婆森林Ⅱ
            100040110,  // 金银岛 - 树林的底层
            100050000,  // 金银岛 - 魔法密林南郊
            101000103,  // 金银岛 - 忍苦树林（四层）
            101010000,  // 金银岛 - 魔法密林北郊
            101010100,  // 金银岛 - 大木林Ⅰ
            101010101,  // 金银岛 - 大木林Ⅱ
            101010102,  // 金银岛 - 大木林Ⅲ
            101020000,  // 金银岛 - 魔法密林北部
            101020002,  // 金银岛 - 北部森林训练场Ⅰ
            101020003,  // 金银岛 - 北部森林训练场Ⅱ
            101020004,  // 金银岛 - 北部森林训练场Ⅲ
            101020005,  // 金银岛 - 北部森林训练场Ⅳ
            101020006,  // 金银岛 - 北部森林训练场Ⅴ
            101020007,  // 金银岛 - 北部森林训练场Ⅵ
            101020008,  // 金银岛 - 北部森林训练场Ⅶ
            101020009,  // 金银岛 - 北部森林训练场Ⅷ
            101020010,  // 金银岛 - 北部森林训练场Ⅸ
            101030000,  // 金银岛 - 勇士部落东部
            101030001,  // 金银岛 - 野猪的领土Ⅱ
            101030100,  // 金银岛 - 岩石路Ⅲ
            101030101,  // 金银岛 - 遗迹发掘地Ⅰ
            101030102,  // 金银岛 - 遗迹发掘地Ⅱ
            101030103,  // 金银岛 - 遗迹发掘地Ⅲ
            101030105,  // 金银岛 - 遗迹之墓Ⅰ
            101030106,  // 金银岛 - 遗迹之墓Ⅱ
            101030107,  // 金银岛 - 遗迹之墓Ⅲ
            101030108,  // 金银岛 - 遗迹之墓Ⅳ
            101030109,  // 金银岛 - 遗迹之峭壁
            101030110,  // 金银岛 - 第1军营
            101030111,  // 金银岛 - 第2军营
            101030112,  // 金银岛 - 第3军营
            101030200,  // 金银岛 - 岩石路Ⅱ
            101030300,  // 金银岛 - 岩石路Ⅰ
            101030400,  // 金银岛 - 东部岩山Ⅰ
            101030401,  // 金银岛 - 东部岩山Ⅱ
            101030402,  // 金银岛 - 东部岩山Ⅲ
            101030403,  // 金银岛 - 东部岩山Ⅳ
            101030404,  // 金银岛 - 东部岩山Ⅴ
            101030405,  // 金银岛 - 东部岩山Ⅵ
            101030406,  // 金银岛 - 东部岩山Ⅶ
            101040000,  // 金银岛 - 勇士部落东入口
            101040001,  // 金银岛 - 野猪的领土
            101040002,  // 金银岛 - 墙后
            101040003,  // 金银岛 - 钢之黑怪之地
            102010000,  // 金银岛 - 勇士村西入口
            102020000,  // 金银岛 - 西部岩山Ⅰ
            102020100,  // 金银岛 - 西部岩山Ⅱ
            102020200,  // 金银岛 - 西部岩山Ⅲ
            102020300,  // 金银岛 - 西部岩山Ⅳ
            102030000,  // 金银岛 - 勇士部落西部
            102040000,  // 金银岛 - 废都北方工地
            102040001,  // 金银岛 - 北方工地顶部
            102050000,  // 金银岛 - 废都北入口
            103010000,  // 金银岛 - 废都南方工地
            103010001,  // 金银岛 - 坠落主义
            103020000,  // 金银岛 - 逆恩森林Ⅰ
            103020100,  // 金银岛 - 逆恩森林Ⅱ
            103020200,  // 金银岛 - 逆恩森林Ⅲ
            103030000,  // 金银岛 - 废都森林I
            103030100,  // 金银岛 - 废都森林II
            103030200,  // 金银岛 - 废都森林III
            104000100,  // 金银岛 - 明珠港郊外
            104000200,  // 金银岛 - 海岸草丛Ⅰ
            104000300,  // 金银岛 - 海岸草丛Ⅱ
            104000400,  // 金银岛 - 海岸草丛Ⅲ
            104010000,  // 金银岛 - 三叉路
            104010001,  // 金银岛 - 猪的海岸
            104010002,  // 金银岛 - 海岸打猎场
            104020000,  // 金银岛 - 射手村西部树林
            104030000,  // 金银岛 - 射手村西部小山
            104030001,  // 金银岛 - 蘑菇山
            104040000,  // 金银岛 - 射手训练场Ⅰ
            104040001,  // 金银岛 - 射手训练场Ⅱ
            104040002,  // 金银岛 - 射手训练场Ⅲ
            105040306,  // 金银岛 - 巨人之林
            105040314,  // 金银岛 - 沉睡森林（五层）
            105070002,  // 金银岛 - 蘑菇王之墓
            105090310,  // 金银岛 - 龙族之地
            105090311,  // 金银岛 - 冰冷的摇篮
            105090312,  // 金银岛 - 龙族之巢
            106000000,  // 金银岛 - 幽深的峡谷Ⅰ
            106000001,  // 金银岛 - 危险的峡谷
            106000002,  // 金银岛 - 危险的峡谷Ⅱ
            106000100,  // 金银岛 - 幽深的峡谷Ⅱ
            106000101,  // 金银岛 - 火焰之地Ⅰ
            106000110,  // 金银岛 - 火焰之地Ⅱ
            106000120,  // 金银岛 - 火焰之地Ⅲ
            106000130,  // 金银岛 - 火焰之地Ⅳ
            106000140,  // 金银岛 - 火焰之地Ⅴ
            106000200,  // 金银岛 - 幽深峡谷Ⅲ
            106000300,  // 金银岛 - 勇士部落迷宫入口
            106010000,  // 金银岛 - 迷宫通道
            106010100,  // 金银岛 - 射手村迷宫入口
            106010101,  // 金银岛 - 石人寺院门外
            106010102,  // 金银岛 - 石人寺院入口
            106010103,  // 金银岛 - 石人寺院Ⅰ
            106010104,  // 金银岛 - 石人寺院Ⅱ
            106010105,  // 金银岛 - 石人寺院Ⅲ
            106010106,  // 金银岛 - 石人寺院Ⅳ
            107000000,  // 金银岛 - 沼泽地Ⅰ
            107000001,  // 金银岛 - 青蛇沼泽地
            107000100,  // 金银岛 - 沼泽地Ⅱ
            107000200,  // 金银岛 - 沼泽地Ⅲ
            107000300,  // 金银岛 - 鳄鱼潭Ⅰ
            107000400,  // 金银岛 - 鳄鱼潭Ⅱ
            107000401,  // 金银岛 - 猴子沼泽地Ⅰ
            107000402,  // 金银岛 - 猴子沼泽地Ⅱ
            107000403   // 金银岛 - 猴子沼泽地Ⅲ
    );

    // 神秘岛 - 野外有怪物的地图
    public static final List<Integer> EL_NATH_FIELD_MAPS = List.of(
            200010000,  // 神秘岛 - 云彩公园Ⅰ
            200010100,  // 神秘岛 - 三色庭院的通道
            200010110,  // 神秘岛 - 红色庭院Ⅰ
            200010111,  // 神秘岛 - 红色庭院Ⅱ
            200010120,  // 神秘岛 - 黄色庭院Ⅰ
            200010121,  // 神秘岛 - 黄色庭院Ⅱ
            200010130,  // 神秘岛 - 蓝色庭院Ⅰ
            200010131,  // 神秘岛 - 蓝色庭院Ⅱ
            200010200,  // 神秘岛 - 天空楼梯Ⅰ
            200010300,  // 神秘岛 - 天空楼梯Ⅱ
            200010301,  // 神秘岛 - 黑暗庭院Ⅰ
            200010302,  // 神秘岛 - 黑暗庭院Ⅱ
            200020000,  // 神秘岛 - 云彩公园Ⅱ
            200030000,  // 神秘岛 - 散步路Ⅰ
            200040000,  // 神秘岛 - 云彩公园Ⅲ
            200040001,  // 神秘岛 - 暗影花园
            200050000,  // 神秘岛 - 云彩公园Ⅳ
            200060000,  // 神秘岛 - 散步路Ⅱ
            200070000,  // 神秘岛 - 云彩公园Ⅴ
            200080000,  // 神秘岛 - 云彩公园Ⅵ
            200080200,  // 神秘岛 - 通天塔<20层>
            200080300,  // 神秘岛 - 通天塔<19层>
            200080400,  // 神秘岛 - 通天塔<18层>
            200080500,  // 神秘岛 - 通天塔<17层>
            200080600,  // 神秘岛 - 通天塔<16层>
            200080700,  // 神秘岛 - 通天塔<15层>
            200080800,  // 神秘岛 - 通天塔<14层>
            200080900,  // 神秘岛 - 通天塔<13层>
            200081000,  // 神秘岛 - 通天塔<12层>
            200081100,  // 神秘岛 - 通天塔<11层>
            200081200,  // 神秘岛 - 通天塔<10层>
            200081300,  // 神秘岛 - 通天塔<9层>
            200081400,  // 神秘岛 - 通天塔<8层>
            200081500,  // 神秘岛 - 通天塔<7层>
            200081600,  // 神秘岛 - 通天塔<6层>
            200081700,  // 神秘岛 - 通天塔<5层>
            200081800,  // 神秘岛 - 通天塔<4层>
            200081900,  // 神秘岛 - 通天塔<3层>
            200082000,  // 神秘岛 - 通天塔<2层>
            200082100,  // 神秘岛 - 通天塔<1层>
            200082300,  // 神秘岛 - 通天塔<地下2层>
            211000200,  // 神秘岛 - 冰雪山丘
            211010000,  // 神秘岛 - 冰面Ⅰ
            211020000,  // 神秘岛 - 冰面Ⅱ
            211030000,  // 神秘岛 - 结冰的平原Ⅰ
            211040000,  // 神秘岛 - 结冰的平原Ⅱ
            211040001,  // 神秘岛 - 王冠之地
            211040100,  // 神秘岛 - 冰雪峡谷Ⅰ
            211040101,  // 神秘岛 - 雪人谷
            211040200,  // 神秘岛 - 冰雪峡谷Ⅱ
            211040300,  // 神秘岛 - 尖锐的绝壁Ⅰ
            211040400,  // 神秘岛 - 尖锐的绝壁Ⅱ
            211040500,  // 神秘岛 - 狼的领土Ⅰ
            211040600,  // 神秘岛 - 狼的领土Ⅱ
            211040700,  // 神秘岛 - 危险的绝壁
            211040800,  // 神秘岛 - 狼的领土Ⅲ
            211040900,  // 神秘岛 - 狼的领土Ⅳ
            211041000,  // 神秘岛 - 狼的领土Ⅴ
            211041100,  // 神秘岛 - 死亡之林Ⅰ
            211041200,  // 神秘岛 - 死亡之林Ⅱ
            211041300,  // 神秘岛 - 死亡之林Ⅲ
            211041400,  // 神秘岛 - 死亡之林Ⅳ
            211041500,  // 神秘岛 - 废矿区Ⅰ
            211041600,  // 神秘岛 - 废矿区Ⅱ
            211041700,  // 神秘岛 - 废矿区Ⅲ
            211041800,  // 神秘岛 - 废矿区Ⅳ
            211041900,  // 神秘岛 - 通道
            211042000,  // 神秘岛 - 艰苦洞穴Ⅰ
            211042100,  // 神秘岛 - 艰苦洞穴Ⅱ
            211042101,  // 神秘岛 - 连环洞穴
            211042200  // 神秘岛 - 艰苦洞穴Ⅲ

    );
}
